package com.testerkit.common.constants;

public class ConstantWatcher {
    public static String[] OK = {"确定", "OK", "Ok", "ok", "確定", "确认", "確認"};
    public static String[] ALLOW = {"允许", "允许(\\(\\d{1,}秒\\)){0,}", "允許", "Allow", "ALLOW", "总是允许", "始终允许", "允许一次", "设为允许"};
    private static String[] AGREE = {"是", "Yes", "yes", "好", "同意", "接受", "始终同意", "我知道了", "授予权限"
            , "强行关闭", "完成", "继续", "強行關閉", "繼續"
            , "忽略", "暂不处理", "暂不更新", "不，以后再说。", "稍后安装", "稍后更新", "稍后", "稍后提醒", "稍后提示", "稍候", "暂不升级"};

    public static String[] INSTALL = {};

    public static String[] NEXT = {"下一步", "下壹步", "仅充电", "删除", "立即删除", "清除"
            , "继续安装", "安装", "安裝", "Install", "继续安装旧版本", "覆盖安装", "重新安装", "我已充分了解该风险.*继续安装", "替换"};


    public static String[] NEXT_NOT_PROMPT = new String[]{"我已充分了解该风险，继续安装", "不再显示此内容", "不再提示", "不再提醒", "下次不再提示", "保存为默认设置," +
            "以后不再提醒", "下次不再提醒", "不再顯示此內容", "保存為默認設置,以後不再提醒", "记住", "記住", "记住我的选择", "记住我的选择。", "記住我的選擇", "记住此选择",
            "記住此選擇", "下次记住我的选择", "下次記住我的選擇", "下次不再询问", "下次不再詢問", "24小时内记住选择", "不允许后不再询问", "拒绝后下次安装不再提示", "禁止后不再询问"};


    public static String OPPO_PWD = "1qazxsw2.,";

}
